app/views/catarse_bootstrap/projects/_dashboard_basics.html.slim

SELECT "categories".* FROM "categories"   ORDER BY "categories"."name_pt" ASC
---

              = form.association :category, as: :select,
                collection: Category.order(:name_pt),
                prompt: t('simple_form.prompts.project.category'),
                wrapper: :two_columns,
                wrapper_class: 'w-row u-marginbottom-30 card card-terciary medium',
                label_wrapper_html: { class: 'w-col w-col-5 w-subcol' },
                text_field_wrapper_html: { class: 'w-col w-col-7' },
                input_html: { class: 'w-select text-field positive medium', required: true },
                validation_text: false