app/views/catarse_bootstrap/users/_dashboard_billing.html.slim

        .w-col.w-col-2.w-col-small-2
      - resource.credit_cards.each do |credit_card|
        .w-row.card
          .w-col.w-col-5.w-col-small-5
            .fontsize-small.fontweight-semibold
---
SELECT "credit_cards".* FROM "credit_cards"  WHERE "credit_cards"."user_id" = $1  [["user_id", 1]]