app/views/catarse_bootstrap/users/_dashboard_contributions.html.slim

- if resource.contributions.empty?
  .w-container
    .w-row.u-margintop-30.u-text-center
      .w-col.w-col-6
       .w-col.w-col-3
       .w-col.w-col-3
---
SELECT  1 AS one FROM "contributions"  WHERE "contributions"."user_id" = $1 LIMIT 1  [["user_id", 1]]