app/views/catarse_bootstrap/users/_dashboard_notifications.html.slim

SELECT "category_followers".* FROM "category_followers"  WHERE "category_followers"."user_id" = $1  [["user_id", 1]]
---
                .w-col.w-col-8
                  - @user.category_followers.all.each do |category_follower|
                    .w-checkbox.w-clearfix

SELECT "projects".* FROM "projects"  WHERE 1=0
---
                .w-col.w-col-8
                  - @user.projects_in_reminder.each do |project|
                    .w-checkbox.w-clearfix