app/controllers/projects_controller.rb

INSERT INTO "projects" ("category_id", "created_at", "name", "permalink", "state", "traffic_sources", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    p "Project0: #{@project.inspect}"
    @project = Project.new
    p "Project1: #{@project.inspect}"
    @project.attributes = permitted_params.merge(user: current_user, referral_link: referral_link)
    p "Project2: #{@project.inspect}"
    authorize @project
    p "Project: #{@project.inspect}"
    if @project.save